nxp-mcuxpresso/mcux-soc-svd/MCXN526T/MCXN526T_cm33_core0.xml
        <register>
          <name>INT_SIGNAL_EN</name>
          <description>Interrupt Signal Enable</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CCIEN</name>
              <description>Command complete interrupt enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CCIEN_a</name>
                  <description>Masked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCIEN_b</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TCIEN</name>
              <description>Transfer complete interrupt enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TCIEN_a</name>
                  <description>Masked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCIEN_b</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BGEIEN</name>
              <description>Block gap event interrupt enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BGIEN_a</name>
                  <description>Masked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BGIEN_b</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DINTIEN</name>
              <description>DMA interrupt enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DINTIEN_b</name>
                  <description>Masked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DINTIEN_a</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BWRIEN</name>
              <description>Buffer write ready interrupt enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BWRIEN_a</name>
                  <description>Masked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BWRIEN_b</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BRRIEN</name>
              <description>Buffer read ready interrupt enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BRRIEN_b</name>
                  <description>Masked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BRRIEN_a</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CINSIEN</name>
              <description>Card insertion interrupt enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CINSIEN_a</name>
                  <description>Masked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CINSIEN_b</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CRMIEN</name>
              <description>Card removal interrupt enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CRMIEN_a</name>
                  <description>Masked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRMIEN_b</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CINTIEN</name>
              <description>Card interrupt enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CINTIEN_b</name>
                  <description>Masked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CINTIEN_a</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTEIEN</name>
              <description>Re-tuning event interrupt enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RTEIEN_O</name>
                  <description>Masked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTEIEN_N</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TPIEN</name>
              <description>Tuning Pass interrupt enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TPIEN_R</name>
                  <description>Masked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TPIEN_Q</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTOEIEN</name>
              <description>Command timeout error interrupt enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CTOEIEN_b</name>
                  <description>Masked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTOEIEN_a</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCEIEN</name>
              <description>Command CRC error interrupt enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CCEIEN_B</name>
                  <description>Masked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCEIEN_a</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CEBEIEN</name>
              <description>Command end bit error interrupt enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CEBEIEN_b</name>
                  <description>Masked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEBEIEN_a</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CIEIEN</name>
              <description>Command index error interrupt enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CIEIEN_B</name>
                  <description>Masked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CIEIEN_a</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DTOEIEN</name>
              <description>Data timeout error interrupt enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DTOEIEN_B</name>
                  <description>Masked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTOEIEN_a</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCEIEN</name>
              <description>Data CRC error interrupt enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCEIEN_B</name>
                  <description>Masked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCEIEN_a</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DEBEIEN</name>
              <description>Data end bit error interrupt enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEBEIEN_B</name>
                  <description>Masked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBEIEN_a</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AC12EIEN</name>
              <description>Auto CMD12 error interrupt enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AC12EIEN_b</name>
                  <description>Masked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AC12EIEN_a</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TNEIEN</name>
              <description>Tuning error interrupt enable</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TNEIEN_B</name>
                  <description>Masked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TNEIEN_a</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMAEIEN</name>
              <description>DMA error interrupt enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMAEIEN_B</name>
                  <description>Masked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAEIEN_a</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>AUTOCMD12_ERR_STATUS</name>
          <description>Auto CMD12 Error Status</description>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AC12NE</name>
              <description>Auto CMD12 not executed</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AC12NE_B</name>
                  <description>Executed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AC12NE_a</name>
                  <description>Not executed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AC12TOE</name>
              <description>Auto CMD12 / 23 timeout error</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AC12TOE_B</name>
                  <description>No error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AC12TOE_a</name>
                  <description>Time out</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AC12CE</name>
              <description>Auto CMD12 / 23 CRC error</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AC12CE_B</name>
                  <description>No CRC error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AC12CE_a</name>
                  <description>CRC error met in Auto CMD12/23 response</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AC12EBE</name>
              <description>Auto CMD12 / 23 end bit error</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AC12EBE_B</name>
                  <description>No error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AC12EBE_a</name>
                  <description>End bit error generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AC12IE</name>
              <description>Auto CMD12 / 23 index error</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AC12IE_B</name>
                  <description>No error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AC12IE_a</name>
                  <description>Error, the CMD index in response is not CMD12/23</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CNIBAC12E</name>
              <description>Command not issued by Auto CMD12 error</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CNIBAC12E_B</name>
                  <description>No error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNIBAC12E_a</name>
                  <description>Not issued</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXECUTE_TUNING</name>
              <description>Execute tuning</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EX_TUN_B</name>
                  <description>Tuning procedure is aborted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ex_tun_a</name>
                  <description>Start tuning procedure</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SMP_CLK_SEL</name>
              <description>Sample clock select</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SMP_CLK_B</name>
                  <description>Fixed clock is used to sample data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SMP_CLK_a</name>
                  <description>Tuned clock is used to sample data</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
